In [36]:
import pandas as pd
import random
df = pd.read_excel('score.xlsx',index_col='지원번호')

In [37]:
df['요일'] = 0

In [ ]:
### 특정셀 부분을 수정
df.loc['1번','요일'] = 5
df.iloc[1,9] = 2

## 컬럼 전체를 수정
df['요일'] = 5

In [38]:
df.shape
# 랜덤으로 0-6까지 숫자 입력
for i in range(8):
  df.iloc[i,9] = random.randint(0,6)

In [39]:
def func(x):
  if x == 0: return "일요일"
  elif x == 1: return "월요일"
  elif x == 2: return "화요일"
  elif x == 3: return "수요일"
  elif x == 4: return "목요일"
  elif x == 5: return "금요일"
  elif x == 6: return "토요일"

In [40]:
df['요일'] = df['요일'].apply(func)

In [41]:
## 결과컬럼 생성
df['결과'] = '불합격'

## 국어점수가 60점이상이면 합격으로 수정하시오.
filt = (df['국어']>=60)
df.loc[filt,'결과'] = '합격'

In [ ]:
## 학교+등학교
## 키 + 'cm'

In [ ]:
## astype() 타입변경후 문자열 + 문자열
df['키'] =  df['키'].astype(str)+'cm'

In [43]:
df

       이름    학교      키   국어   영어   수학  과학  사회        SW특기   요일   결과
지원번호
1번    강나래   구로고  197cm   90   85  100  95  85      Python  금요일   합격
2번    강태원   구로고  184cm   40   35   50  55  25        Java  수요일  불합격
3번    강호림   구로고  168cm   80   75   70  80  75  Javascript  목요일   합격
4번    김수찬   구로고  187cm   40   60   70  75  80         NaN  일요일  불합격
5번    김재욱   구로고  188cm   15   20   10  35  10         NaN  목요일  불합격
6번    박동현  디지털고  202cm   80  100   95  85  80           C  월요일   합격
7번    박혜정  디지털고  188cm   55   65   45  40  35      PYTHON  화요일  불합격
8번    승근열  디지털고  190cm  100   85   90  95  95          C#  일요일   합격

In [51]:
# df.groupby('학교')['이름'].count()
# df.groupby('학교')['키'].mean()

In [59]:
df.groupby('학교')['이름'].count()
df.groupby('학교')['이름'].sum()

학교
구로고     강나래강태원강호림김수찬김재욱
디지털고          박동현박혜정승근열
Name: 이름, dtype: object

* 컬럼이 숫자가 아니면 실행이 안됨
* mean(), max(),min(), std()

In [62]:
df.groupby('학교')['국어'].mean()
df.groupby('학교')['국어'].count()
df.groupby('학교')['국어'].sum().sort_values(ascending=False)

학교
구로고     265
디지털고    235
Name: 국어, dtype: int64

In [66]:
df['학년'] = [3,3,2,1,1,3,2,2]

In [67]:
df.groupby(['학교','학년'])['국어'].agg(['mean','min','max','sum'])

         mean  min  max  sum
학교   학년
구로고  1   27.5   15   40   55
     2   80.0   80   80   80
     3   65.0   40   90  130
디지털고 2   77.5   55  100  155
     3   80.0   80   80   80

In [68]:
df = pd.read_csv('chipotle.tsv',sep="\t")

In [70]:
df.shape

(4622, 5)

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [72]:
df = pd.read_csv('drinks.csv')

In [74]:
df.shape

(193, 6)

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [76]:
### 모든 술의 총량을 출력하시오.
### total_servings 컬럼을 구하시오. beer+spirit+wine
# / 전체 알코올 도수를 확인
df['total_servings'] = df['beer_servings']+df['spirit_servings']+df['wine_servings']
###

In [79]:
df['continent'].unique()

array(['AS', 'EU', 'AF', nan, 'SA', 'OC'], dtype=object)

In [89]:
df.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent', 'total_servings'],
      dtype='object')

In [96]:
filt = df['continent'].isnull()
df.loc[filt,'total_servings'].sum()

np.int64(0)

In [ ]:
## contient : 대륙 Nan값을 OT로 변경
df['continent'].fillna('OT',inplace=True)

In [97]:
### 대륙별 total_servings을 구하시오.
df.groupby('continent')['total_servings'].sum().sort_values()

continent
OC     2940
SA     4227
AS     4706
AF     4986
OT     7721
EU    21085
Name: total_servings, dtype: int64

In [98]:
df.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent', 'total_servings'],
      dtype='object')

In [101]:
df['country'].head()

0    Afghanistan
1        Albania
2        Algeria
3        Andorra
4         Angola
Name: country, dtype: object

In [102]:
### 술 소비량 대비 알콜 비율이 어느 정도 되는지 출력하시오.
## 알코올 비율을 계산해서 alcohol_rate 컬럼을 추가
## total_litres_of_pure_alcohol 알코올 비율을 total_servings 으로 나눈 것
## 술소비량 대비 알콜 비율이 높은 나라별 20개를 출력하시오.
df['alcohol_rate'] = df['total_litres_of_pure_alcohol'] / df['total_servings']

## 대륙별 알콜비율도 계산해서 출력하시오.

In [114]:
df.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent', 'total_servings',
       'alcohol_rate'],
      dtype='object')

In [119]:
df.groupby('continent')['alcohol_rate'].sum().sort_values(ascending=False)

continent
AF    2.636258
EU    0.788717
AS    0.719797
OT    0.410644
OC    0.270327
SA    0.214415
Name: alcohol_rate, dtype: float64

In [130]:
df[['country','alcohol_rate']].sort_values('alcohol_rate',ascending=False).head()

          country  alcohol_rate
63         Gambia      0.266667
153  Sierra Leone      0.223333
124       Nigeria      0.185714
179        Uganda      0.153704
142        Rwanda      0.151111

In [126]:
### kor 포함되어 있는 나라를 출력하시오..
filt = df['country'].str.lower().str.contains('kor')
df[filt][['country','alcohol_rate']]

         country  alcohol_rate
46   North Korea      0.000000
138  South Korea      0.059394

In [123]:
df['country']

0      Afghanistan
1          Albania
2          Algeria
3          Andorra
4           Angola
          ...
188      Venezuela
189        Vietnam
190          Yemen
191         Zambia
192       Zimbabwe
Name: country, Length: 193, dtype: object

In [110]:
df['alcohol_rate'].fillna(0,inplace=True)
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,total_servings,alcohol_rate
0,Afghanistan,0,0,0,0.0,AS,0,0.000000
1,Albania,89,132,54,4.9,EU,275,0.017818
2,Algeria,25,0,14,0.7,AF,39,0.017949
3,Andorra,245,138,312,12.4,EU,695,0.017842
4,Angola,217,57,45,5.9,AF,319,0.018495
...,...,...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA,436,0.017661
189,Vietnam,111,2,1,2.0,AS,114,0.017544
190,Yemen,6,0,0,0.1,AS,6,0.016667
191,Zambia,32,19,4,2.5,AF,55,0.045455
192,Zimbabwe,64,18,4,4.7,AF,86,0.054651

In [113]:
df[['country','alcohol_rate']].sort_values('alcohol_rate',ascending=False).head(20)

                      country  alcohol_rate
63                     Gambia      0.266667
153              Sierra Leone      0.223333
124                   Nigeria      0.185714
179                    Uganda      0.153704
142                    Rwanda      0.151111
183                  Tanzania      0.132558
26               Burkina Faso      0.110256
33   Central African Republic      0.090000
28              Cote d'Ivoire      0.088889
104                      Mali      0.085714
162                     Sudan      0.080952
101                    Malawi      0.075000
27                    Burundi      0.071591
47                   DR Congo      0.063889
138               South Korea      0.059394
192                  Zimbabwe      0.054651
164                 Swaziland      0.050000
191                    Zambia      0.045455
66                      Ghana      0.040909
31                   Cameroon      0.038158